name: "NU-InNet-1.1"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "jobs/20160723-203243-82a9/mean.binaryproto"
  }
  data_param {
    source: "jobs/20160723-203243-82a9/train_db"
    batch_size: 128
    backend: LMDB
  }
}

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "jobs/20160723-203243-82a9/mean.binaryproto"
  }
  data_param {
    source: "jobs/20160723-203243-82a9/val_db"
    batch_size: 128
    backend: LMDB
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2_bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv3_bn"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_scale"
  type: "Scale"
  bottom: "conv3"
  top: "conv3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_relu"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv3"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool1"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv4_bn"
  type: "BatchNorm"
  bottom: "conv4"
  top: "conv4"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_scale"
  type: "Scale"
  bottom: "conv4"
  top: "conv4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_relu"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv5_bn"
  type: "BatchNorm"
  bottom: "conv5"
  top: "conv5"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv5_scale"
  type: "Scale"
  bottom: "conv5"
  top: "conv5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv5_relu"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv5"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "nu_inception_1x1"
  type: "Convolution"
  bottom: "pool2"
  top: "nu_inception_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_1x1_scale"
  type: "Scale"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_1x1"
  type: "ReLU"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
}
layer {
  name: "nu_inception_3x3_reduce"
  type: "Convolution"
  bottom: "pool2"
  top: "nu_inception_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_reduce"
  top: "nu_inception_3x3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_reduce_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_reduce"
  top: "nu_inception_3x3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_3x3_reduce"
  type: "ReLU"
  bottom: "nu_inception_3x3_reduce"
  top: "nu_inception_3x3_reduce"
}
layer {
  name: "nu_inception_3x3"
  type: "Convolution"
  bottom: "nu_inception_3x3_reduce"
  top: "nu_inception_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_scale"
  type: "Scale"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_3x3"
  type: "ReLU"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
}
layer {
  name: "nu_inception_3x3_0_reduce"
  type: "Convolution"
  bottom: "pool2"
  top: "nu_inception_3x3_0_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_0_reduce_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_0_reduce"
  top: "nu_inception_3x3_0_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_0_reduce_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_0_reduce"
  top: "nu_inception_3x3_0_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_0_reduce_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_0_reduce"
  top: "nu_inception_3x3_0_reduce"
}
layer {
  name: "nu_inception_3x3_1"
  type: "Convolution"
  bottom: "nu_inception_3x3_0_reduce"
  top: "nu_inception_3x3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_1_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_1"
  top: "nu_inception_3x3_1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_1_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_1"
  top: "nu_inception_3x3_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_1_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_1"
  top: "nu_inception_3x3_1"
}
layer {
  name: "nu_inception_3x3_2"
  type: "Convolution"
  bottom: "nu_inception_3x3_1"
  top: "nu_inception_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_2_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_2"
  top: "nu_inception_3x3_2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_2_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_2"
  top: "nu_inception_3x3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_2_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_2"
  top: "nu_inception_3x3_2"
}
layer {
  name: "nu_inception_3x3_0_3_reduce"
  type: "Convolution"
  bottom: "pool2"
  top: "nu_inception_3x3_0_3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_0_3_reduce_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_0_3_reduce"
  top: "nu_inception_3x3_0_3_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_0_3_reduce_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_0_3_reduce"
  top: "nu_inception_3x3_0_3_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_0_3_reduce_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_0_3_reduce"
  top: "nu_inception_3x3_0_3_reduce"
}
layer {
  name: "nu_inception_3x3_1_3"
  type: "Convolution"
  bottom: "nu_inception_3x3_0_3_reduce"
  top: "nu_inception_3x3_1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_1_3_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_1_3"
  top: "nu_inception_3x3_1_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_1_3_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_1_3"
  top: "nu_inception_3x3_1_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_1_3_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_1_3"
  top: "nu_inception_3x3_1_3"
}
layer {
  name: "nu_inception_3x3_2_3"
  type: "Convolution"
  bottom: "nu_inception_3x3_1_3"
  top: "nu_inception_3x3_2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_2_3_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_2_3"
  top: "nu_inception_3x3_2_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_2_3_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_2_3"
  top: "nu_inception_3x3_2_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_2_3_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_2_3"
  top: "nu_inception_3x3_2_3"
}
layer {
  name: "nu_inception_3x3_3_3"
  type: "Convolution"
  bottom: "nu_inception_3x3_2_3"
  top: "nu_inception_3x3_3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "nu_inception_3x3_3_3_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3_3_3"
  top: "nu_inception_3x3_3_3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_3_3_scale"
  type: "Scale"
  bottom: "nu_inception_3x3_3_3"
  top: "nu_inception_3x3_3_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_3x3_3_3_relu"
  type: "ReLU"
  bottom: "nu_inception_3x3_3_3"
  top: "nu_inception_3x3_3_3"
}
layer {
  name: "nu_inception_output"
  type: "Concat"
  bottom: "nu_inception_1x1"
  bottom: "nu_inception_3x3"
  bottom: "nu_inception_3x3_2"
  bottom: "nu_inception_3x3_3_3"
  top: "nu_inception_output"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "nu_inception_output"
  top: "pool3"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 50
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}
